In [48]:
import pandas as pd
import numpy as np

In [9]:
enrollment = pd.read_excel('Performance_Task.xlsx',sheet_name = 'Enrollment')

In [10]:
enrollment.head()

   student_id school_name  grade_level_2019
0       13898    School G                 1
1       27795    School G                 1
2       22938    School E                 1
3       22431    School F                 1
4       18048    School E                 1

In [15]:
enrollment.shape

(2788, 3)

In [11]:
MAP_scores = pd.read_excel('Performance_Task.xlsx',sheet_name = 'MAP Scores')

In [12]:
MAP_scores.head()

,student_id,year,map_term,subject,rit_score,percentile,quartile,typical_fall_to_spring_growth
0,13898,2019,Fall,Reading,161,59,3,18
1,27795,2019,Fall,Reading,158,50,3,19
2,22938,2019,Fall,Reading,162,62,3,18
3,22431,2019,Fall,Reading,162,62,3,18
4,18048,2019,Fall,Reading,166,73,3,17

In [16]:
MAP_scores.shape

(11118, 8)

In [19]:
data = pd.merge(enrollment, MAP_scores, on = 'student_id')

In [20]:
data.head()

,student_id,school_name,grade_level_2019,year,map_term,subject,rit_score,percentile,quartile,typical_fall_to_spring_growth
0,13898,School G,1,2019,Fall,Reading,161,59,3,18
1,13898,School G,1,2019,Fall,Math,166,69,3,20
2,13898,School G,1,2019,Spring,Reading,175,43,2,.
3,13898,School G,1,2019,Spring,Math,186,65,3,.
4,27795,School G,1,2019,Fall,Reading,158,50,3,19

In [13]:
Spec_Programs = pd.read_excel('Performance_Task.xlsx',sheet_name = 'Special Programs')

In [14]:
Spec_Programs.head()

   student_id program_name
0       13898         SPED
1       27795         SPED
2       22938            .
3       22431            .
4       18048            .

In [18]:
Spec_Programs.shape

(2787, 2)

In [22]:
data = pd.merge(data,Spec_Programs, on = 'student_id')

In [23]:
data.head()

,student_id,school_name,grade_level_2019,year,map_term,subject,rit_score,percentile,quartile,typical_fall_to_spring_growth,program_name
0,13898,School G,1,2019,Fall,Reading,161,59,3,18,SPED
1,13898,School G,1,2019,Fall,Math,166,69,3,20,SPED
2,13898,School G,1,2019,Spring,Reading,175,43,2,.,SPED
3,13898,School G,1,2019,Spring,Math,186,65,3,.,SPED
4,27795,School G,1,2019,Fall,Reading,158,50,3,19,SPED

In [24]:
data.tail()

,student_id,school_name,grade_level_2019,year,map_term,subject,rit_score,percentile,quartile,typical_fall_to_spring_growth,program_name
11117,24197,School D,8,2019,Spring,Math,226,40,2,.,.
11118,27656,School D,8,2019,Fall,Math,199,5,1,6,.
11119,27656,School D,8,2019,Spring,Math,.,.,.,.,.
11120,29777,School E,0,2019,Fall,Math,133,32,2,21,.
11121,29777,School E,0,2019,Spring,Math,.,.,.,.,.

In [25]:
data.shape

(11122, 11)

All the features are needed to perform exploratory data analysis except student_id. 
student_id was needed to merge the tables together but it will not give us any valuable information.  This feature is a unique student identifier and would be valuable if individual teachers were given this information to use to identify which topics they need to reteach or spend more time on in the future.  We will keep ths feature for now.

In [26]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11122 entries, 0 to 11121
Data columns (total 11 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   student_id                     11122 non-null  int64
 1   school_name                    11122 non-null  object
 2   grade_level_2019               11122 non-null  int64
 3   year                           11122 non-null  int64
 4   map_term                       11122 non-null  object
 5   subject                        11122 non-null  object
 6   rit_score                      11122 non-null  object
 7   percentile                     11122 non-null  object
 8   quartile                       11122 non-null  object
 9   typical_fall_to_spring_growth  11122 non-null  object
 10  program_name                   11122 non-null  object
dtypes: int64(3), object(8)
memory usage: 1.0+ MB

In [27]:
data.describe()

         student_id  grade_level_2019     year
count  11122.000000      11122.000000  11122.0
mean   19926.775220          4.227837   2019.0
std     5732.455867          2.714756      0.0
min    10000.000000          0.000000   2019.0
25%    14981.000000          2.000000   2019.0
50%    19856.000000          5.000000   2019.0
75%    24873.000000          7.000000   2019.0
max    29996.000000          8.000000   2019.0

In [28]:
data['school_name'].unique()

array(['School G', 'School E', 'School F', 'School B', 'School C',
       'School D', 'School A'], dtype=object)

In [33]:
data['school_name'].value_counts()

School E    2154
School F    1724
School D    1586
School A    1482
School C    1440
School B    1422
School G    1314
Name: school_name, dtype: int64

There are 7 schools in total.  Each letter represents a school.

In [34]:
data['grade_level_2019'].unique()

array([1, 2, 3, 4, 5, 6, 7, 8, 0])

In [35]:
data['grade_level_2019'].value_counts()

6    1574
7    1488
8    1476
5    1392
2    1280
1    1278
0    1270
3     900
4     464
Name: grade_level_2019, dtype: int64

This data is for students from Pre-K to 8th grade.  Pre-K to 4th is primary school.  Middle school is 5th to 8th.  

The number of student scores for the MAP test decreased tremedously from 2nd grade to 3rd and then to 4th.  The number of scores increased by 928 from 4th to 5th grade. 

Lets group by school and grade if there was a school that did not submit scores for a particuar school

In [37]:
Middle_School = data[data['grade_level_2019'] > 4]

In [39]:
Middle_School['school_name'].unique()

array(['School B', 'School C', 'School D', 'School A'], dtype=object)

In [44]:
Primary_School = data[data['grade_level_2019'] < 5]

In [60]:
pd.pivot_table(Primary_School, index = ['grade_level_2019'], columns = ['school_name'], aggfunc = 'count')

ValueError: Grouper for 'grade_level_2019' not 1-dimensional